src/main/resources/samples/discovery-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
	xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
	xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
	xmlns:tds="http://www.onvif.org/ver10/device/wsdl">
	<soap:Header>
		<wsa:To>urn:uuid:uuid:your_unique_uuid</wsa:To>
		<wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/Discovery
		</wsa:Action>
	</soap:Header>
	<soap:Body>
		<tds:Probe />
	</soap:Body>
</soap:Envelope>